const allProvince = [
  "กรุงเทพมหานคร",
  "กระบี่",
  "กาญจนบุรี",
  "กาฬสินธุ์",
  "กำแพงเพชร",
  "ขอนแก่น",
  "จันทบุรี",
  "ฉะเชิงเทรา",
  "ชลบุรี",
  "ชัยนาท",
  "ชัยภูมิ",
  "ชุมพร",
  "เชียงใหม่",
  "เชียงราย",
  "ตรัง",
  "ตราด",
  "ตาก",
  "นครนายก",
  "นครปฐม",
  "นครพนม",
  "นครราชสีมา",
  "นครศรีธรรมราช",
  "นครสวรรค์",
  "นนทบุรี",
  "นราธิวาส",
  "น่าน",
  "บึงกาฬ",
  "บุรีรัมย์",
  "ปทุมธานี",
  "ประจวบคีรีขันธ์",
  "ปราจีนบุรี",
  "ปัตตานี",
  "พระนครศรีอยุธยา",
  "พะเยา",
  "พังงา",
  "พัทลุง",
  "พิจิตร",
  "พิษณุโลก",
  "เพชรบุรี",
  "เพชรบูรณ์",
  "แพร่",
  "ภูเก็ต",
  "มหาสารคาม",
  "มุกดาหาร",
  "แม่ฮ่องสอน",
  "ยโสธร",
  "ยะลา",
  "ร้อยเอ็ด",
  "ระนอง",
  "ระยอง",
  "ราชบุรี",
  "ลพบุรี",
  "ลำปาง",
  "ลำพูน",
  "เลย",
  "ศรีสะเกษ",
  "สกลนคร",
  "สงขลา",
  "สตูล",
  "สมุทรปราการ",
  "สมุทรสงคราม",
  "สมุทรสาคร",
  "สระแก้ว",
  "สระบุรี",
  "สิงห์บุรี",
  "สุโขทัย",
  "สุพรรณบุรี",
  "สุราษฎร์ธานี",
  "สุรินทร์",
  "หนองคาย",
  "หนองบัวลำภู",
  "อ่างทอง",
  "อำนาจเจริญ",
  "อุดรธานี",
  "อุตรดิตถ์",
  "อุทัยธานี",
  "อุบลราชธานี",
];

// Northern Region (ภาคเหนือ)
const northernRegion = [
  "เชียงราย",
  "เชียงใหม่",
  "น่าน",
  "พะเยา",
  "แพร่",
  "แม่ฮ่องสอน",
  "ลำปาง",
  "ลำพูน",
  "อุตรดิตถ์",
];

// Northeastern Region (ภาคตะวันออกเฉียงเหนือ)
const northeasternRegion =
  "หนองคาย นครพนม สกลนคร อุดรธานี หนองบัวลำภู เลย มุกดาหาร กาฬสินธุ์ ขอนแก่น อำนาจเจริญ ยโสธร ร้อยเอ็ด มหาสารคาม ชัยภูมิ นครราชสีมา บุรีรัมย์ สุรินทร์ ศรีสะเกษ อุบลราชธานี".split(
    " "
  );

const westernRegion = [
  "กาญจนบุรี",
  "ตาก",
  "ประจวบคีรีขันธ์",
  "เพชรบุรี",
  "ราชบุรี",
];

// Central Region (ภาคกลาง)
const centralRegion =
  "กรุงเทพมหานคร พิษณุโลก สุโขทัย เพชรบูรณ์ พิจิตร กำแพงเพชร นครสวรรค์ ลพบุรี ชัยนาท อุทัยธานี สิงห์บุรี อ่างทอง สระบุรี พระนครศรีอยุธยา สุพรรณบุรี นครนายก ปทุมธานี นนทบุรี นครปฐม สมุทรปราการ สมุทรสาคร สมุทรสงคราม".split(
    " "
  );

// Eastern Region (ภาคตะวันออก)
const easternRegion = [
  "จันทบุรี",
  "ฉะเชิงเทรา",
  "ชลบุรี",
  "ปราจีนบุรี",
  "ระยอง",
  "สระแก้ว",
  "ตราด",
];

// Southern Region (ภาคใต้)
const southernRegion = [
  "กระบี่",
  "ชุมพร",
  "ตรัง",
  "นครศรีธรรมราช",
  "นราธิวาส",
  "ปัตตานี",
  "พังงา",
  "พัทลุง",
  "ภูเก็ต",
  "ยะลา",
  "ระนอง",
  "สงขลา",
  "สตูล",
  "สุราษฎร์ธานี",
];

module.exports = {
  allProvince,
  centralRegion,
  northernRegion,
  northeasternRegion,
  southernRegion,
  easternRegion,
  westernRegion,
};
